{"text":"This book is a classic, timeless, relevant book about improving your life, no matter your age or status in life. It makes you think of things in a different way, and improves your overall outlook on life. I would have loved to have a father or grandfather like Steven Covey, as he seems so wise and family oriented. I would have loved to have met him.","label":1}
{"text":"The 7 Habits of Highly Effective People is filled with so many great ideas. This book has a very strong reputation with over 25 million copies sold and it has been published in over 70 countries, the book has lived up to its name and reputation.The information in the book is common sense, but as we learn, is not common practice. Before we learn about 7 habits, we must have healthy deposits in our emotional bank accounts. Once we understand the idea of an emotional bank account, we begin to build the 7 habits. The goal of the book is to make this information a common practice and by the 7th habit, to sharpen our newly formed habits to ensure we enforce personal change.If I had to choose one single take away from the book, it would be in habit #1 Proactive people focus their efforts on their Circle of Influence. This idea is the beginning of learning how to separate the things that matter versus the things that don't and understanding that highly effective people operate based on their principles. Eliminating the circle of concern and investing in the circle of influence is what proactive people do.I highly recommend this book, a must-read classic!","label":1}
{"text":"This book will change your life!! I am in my 20's and read this book in college. It brought insight and from new points of views that I never knew existed before. Depending on where you are in life (career, college, high school) you will likely see thing from a different point of view as it relates to you, but there is sure to be something here for everyone.I heard about this book as a must read along with other very inspiring books like The Millionaire Mentor, Limited Edition, The Alchemist by Paulo Coehlo, and Bob Proctor's books, and other phenomenal books on leadership and entrepreneurship. This book is another must have and I recommend it to anyone!","label":1}
{"text": "This book and the ideas in it are life changing. You will find lots of cliché’s within this book not because it was written full of clichés but because of the cultural power of this book they became clichés. This is really a must read book for anyone from high school up, and should be reread every year or two. Exceptionally practical and helpful, this isn't a business book, this is a life book.I have purchased at least ten copies of this book and have gone through the seminar with my entire company (over 130 people). Following the principles in this book will make you a more highly effective human.", "label": 1}
{"text": "This book is really overrated! I bought this book because of its so many positive reviews. But today I finished the 250 pages, just feeling that this book is not that good as the reviewers say. So I come back to see the negative reviews. Fortunately I found many have the similar impression on this book: 1. verbose; 2. many examples are just from the family of the author, and farfetched. 3. Over-analyzed.", "label": 0}
{"text": "I don't understand the reviews here. Aren't these reviews supposed to be the Audible or audio edition reviews? I was expecting most of the one star reviews to be about problems with the audio edition but nearly all of them seem to be based on the paperback format. How is this helpful to someone wanting a review of the audio edition? I also don't see how it's helpful for people to give such ridiculous reviews for the book. It's one thing to not like the book, but quite another to give such absurd reasons. People clearly indicating they have nothing but contempt for self help books but are supposedly continuing to read them and give them bad reviews. Really? Also, nearly all of the people who complain about self help books all of the time seems to give the same silly reasons. Yes, we know self help books have things in them that have been said before, and yes a lot of the things are common sense, and yes the book could be summarized into a much smaller book. (This last point is true for all books, but especially nonfiction.) What exactly are you expecting? I think most of these people are lazy and want some magic solution to their problems, or want something that has never been said by anyone since the beginning of time. Good luck with that. I am NOT giving the book one star. The one star is for the audio edition. I don't know what the people producing the audio edition were thinking. Stephen Covey should NEVER read books to people! Unless you want to be put to sleep this version of the book is pretty much useless. Even more amazing is the fact that they haven't even recognized the problem and changed the narrator in a more recent audio edition.", "label": 0}
{"text": "This book does not guarantee you success.  There are plenty of people who had gotten rich through random chance of events. As human being we rationalize it. For example, a gambler winning a large sum of money because he thinks we is smart but when he loses, he blames on luck, chance, the gambling institution etc. As a matter of fact much of the self-help industry is full of survivorship bias. This is unfortunate as people are sucked into this type of self-books because they don't have any self-discipline.", "label": 0}
{"text": "I had to buy/read this book for one of my business classes. It's an alright book, it isn't very entertaining. I feel like the seven habits are common knowledge. The book didn't really help me become a more effective person. The book is also very repetitive and does get boring very quickly.Overall, if you have to read this book for a program or a class like I did, it's an alright book.", "label": 0}
{"text": "What an annoying book! I tried to read this book several years ago when it was all the rage in management circles, and they made you read it in college. I didn't get a thing out of it then, but I was much younger & thought I had missed something. Nope! There is nothing redeeming about this book. It is filled with personal stories, lots of religious references, and his own brand of secret language that imparts absolutely no meaning at all. Most of the time I never got the point he was trying to make.Then there is his definition of being proactive. It really means just planning ahead. He says it means we are responsible for our own lives. It means recognizing our responsibility to make things happen. Tell that to the guy in Africa whose choices are limited by the physical environment and the actions of others i.e. government to keep them in place. Covey tries to support this view by pulling out principals put forth by Viktor Frankl in his holocaust survival stories. Mr. Frankl used a technique designed to help him survive mentally in a place where all norms are turned upside down, and all you can do is have some control of your thoughts since all physical circumstances are totally controlled by someone else. Those kept in prison camps during times of war, prisoners kept in solitary confinement, etc. do the same thing because they have noticed if people give up mentally they tend to roll over and die. So, what does this survival technique have to do with his view of being proactive i.e. totally responsible for everything that happens in your life? I don't get that connection! Covey also frequently talks about not using people, then tells you to build emotional bank accounts with others so you can leverage that in the future. Wow! And, this idea of win-win is not based in reality either. In human and animal societies there are winners and losers. Not every brilliant inventor will have all of the lucky and random circumstances to make him wildly successful. What Covey is talking about really is negotiating with someone so that each of you gets part of what they want with neither party getting everything. This is something humans do every day, and it takes no special jargon to comprehend this most basic of human (and animal) behavior. I don't understand how anyone would find this book useful. Don't waste your time on this one.", "label": 0}
{"text": "This is one of the fastest paced books I have ever read. Ayn Rand's characters come to life as she paints very clear pictures of who they are and what they represent. She does this in spite of the fact that the dialogue is sometimes a bit wooden and stilted. In this novel, she sets forth her philosophy of objectivism. She exposes those, such as a character named Peter Keating, an architect, who seemingly achieve greatness by copying others but somehow give the illusion of originality and creativity. In order to achieve greatness, Keating was literally willing to sell anything, including his wife. Thus despite wealth and apparant achievement, his life was empty. Rand begins to formulate her values that altruism is an evil because a society which seeks to achieve this must do so at someone's expense and therefore leads to collectivism. In the person of Ellsworth Toohey, a flamboyant newspaper columnist, she shows how the power hungry manipulate the masses by setting a standard of mediocrity which fosters collectivism.This book is full of passion, including a flaming, complex romantic affair between individualist architect Howard Roarke and socialite Dominique Francon. Their relationship develops from one in which they each seek to assert power over the other while achieving sexual release to one of true love between genuine soul mates. Roarke also has a passion for his work and is uncompromising in his creativity in accomplishing his professional goals. He will not ever compromise these goals despite enormous pressures to do so. Rand believed that there is only black and white in moral issues; there is no gray. Therefore, giving in a little is not compromise but rather, selling out your values and giving in to evil. Roarke was not a man to sell out, he had the courage of his convictions.While setting forth her philosophy, Rand has also given us a novel which has a well developed plot. I found the novel to be gripping and I couldn't put it down. Following the career of Howard Roarke and the machinations of his enemies was fascinating. The plot had enough twists to provide surprises and to hold the reader's interest. This book is both an enjoyable novel as well as a challenging philosophical statement. I like Rand's philosophy and I love this book.", "label": 1}
