{"reviewerID": "AH2L9G3DQHHAJ", "asin": "0000000116", "reviewerName": "chris", "helpful": [5, 5], "reviewText": "Interesting Grisham tale of a lawyer that takes millions of dollars from his firm after faking his own death. Grisham usually is able to hook his readers early and ,in this case, doesn't play his hand to soon. The usually reliable Frank Mueller makes this story even an even better bet on Audiobook.", "overall": 4.0, "summary": "Show me the money!", "unixReviewTime": 1019865600, "reviewTime": "04 27, 2002"}
{"reviewerID": "A2IIIDRK3PRRZY", "asin": "0000000116", "reviewerName": "Helene", "helpful": [0, 0], "reviewText": "The thumbnail is a shirt.  The product shown is a shoe.  The description is a book.This reviewer is confused.", "overall": 1.0, "summary": "Listing is all screwed up", "unixReviewTime": 1395619200, "reviewTime": "03 24, 2014"}
{"reviewerID": "A1TADCM7YWPQ8M", "asin": "0000000868", "reviewerName": "Joel@AWS", "helpful": [10, 10], "reviewText": "I'll be honest. I work for a large online retailer named after a South American river, and ordered this because the ASIN (0000000868) is so ... distinctive ... and, frankly, I wondered what the hell a &quot;reader turntable&quot; was, particularly one with both an editor and an illustrator.A friend suggested that the title was really the result of a very poor translation; that &quot;Reader&quot; was supposed to be &quot;Tales&quot;, &quot;Turntable&quot; was supposed to be &quot;Lyrics&quot; and this was really a book entitled &quot;Korea's Favorite Tales and Lyrics&quot;. Oddly enough, there is such a book, apparently edited by Mr. Hyun and illustrated by Mr. Park.Well, as it turns out, &quot;Reader Turntable SE-14&quot; is not a book. It is, well, a reader turntable: a black rectangular piece of 1/2&quot; particleboard, about 13x16 inches, mounted on a bearing so it can rotate easily. It's a lot like a &quot;Lazy Susan&quot;.It's useful for reading rooms, libraries, etc. Place it on table, put a dictionary or other big heavy reference book on it, and now folks sitting on either side of the table can share the reference, simply turning it towards them when they need to look something up.Construction is sturdy. I (175 lbs) stood on it and it rotated: a bit roughly but it didn't collapse. Bearing quality is modest but serviceable. Black matte finish is tasteful.", "overall": 4.0, "summary": "Not a Bad Translation", "unixReviewTime": 1031702400, "reviewTime": "09 11, 2002"}
{"reviewerID": "AWGH7V0BDOJKB", "asin": "0000013714", "reviewerName": "Barbara Marshall", "helpful": [0, 0], "reviewText": "It had all the songs I wanted but I had ordered the large print version and received the regular version. This was the only thing I did not like.", "overall": 4.0, "summary": "Not the large print", "unixReviewTime": 1383177600, "reviewTime": "10 31, 2013"}
{"reviewerID": "A3UTQPQPM4TQO0", "asin": "0000013714", "reviewerName": "betty burnett", "helpful": [0, 0], "reviewText": "We have many of the old, old issue. But the number had depleted. There were not  enough books to allow us to use them regularly. With the additional supply the books will be used more often.  They arre a good old standby for gospel singing.", "overall": 5.0, "summary": "I was disappointed that you would only allow me to purchase 4 when your inventory showed that you had 14 available.", "unixReviewTime": 1374883200, "reviewTime": "07 27, 2013"}
{"reviewerID": "A8ZS0I5L5V31B", "asin": "0000013714", "reviewerName": "Ephraim O. Nwabuokei", "helpful": [0, 0], "reviewText": "I love this book. I love hymns and love to sing and run my fingers over piano/organ.This book is helpful.", "overall": 5.0, "summary": "GREAT HYMN BOOK!", "unixReviewTime": 1393632000, "reviewTime": "03 1, 2014"}
{"reviewerID": "ACNGUPJ3A3TM9", "asin": "0000013714", "reviewerName": "GCM", "helpful": [0, 0], "reviewText": "We use this type of hymnal at church.  I was looking for the same one; however, this wasn't it. It is a good hymnal, but there isn't enough information to find the version I need.", "overall": 4.0, "summary": "Nice Hymnal", "unixReviewTime": 1386028800, "reviewTime": "12 3, 2013"}
{"reviewerID": "A3BED5QFJWK88M", "asin": "0000013714", "reviewerName": "jimedd", "helpful": [0, 0], "reviewText": "Heavenly Highway HymnsI ordered this hymnal because I learned to read shaped note music when I was a teenager. I play piano but do not sing. I am 85 years old. This hymnal has mostof the songs I have learned over the years. It was exactly what I wanted and needed.It was in good condition and the price was right. I purchased this book from Amazon.", "overall": 4.0, "summary": "Heavenly Highway Hymns", "unixReviewTime": 1350345600, "reviewTime": "10 16, 2012"}
{"reviewerID": "A2SUAM1J3GNN3B", "asin": "0000013714", "reviewerName": "J. McDonald", "helpful": [2, 3], "reviewText": "I bought this for my husband who plays the piano.  He is having a wonderful time playing these old hymns.  The music  is at times hard to read because we think the book was published for singing from more than playing from.  Great purchase though!", "overall": 5.0, "summary": "Heavenly Highway Hymns", "unixReviewTime": 1252800000, "reviewTime": "09 13, 2009"}
{"reviewerID": "APOZ15IEYQRRR", "asin": "0000013714", "reviewerName": "maewest64", "helpful": [0, 0], "reviewText": "This is a large size hymn book which is great to be able to see the songs, notes, etc.  Quality was great, item was new!", "overall": 5.0, "summary": "Awesome Hymn Book", "unixReviewTime": 1362787200, "reviewTime": "03 9, 2013"}
{"reviewerID": "AYEDW3BFK53XK", "asin": "0000013714", "reviewerName": "Missb", "helpful": [0, 0], "reviewText": "We use this hymn book at the mission.  It has most of the well-loved oldies from a time gone by.  Songs like: \"I'll Fly Away\" and \"Closer Walk With Thee\".  If you like a good singalong, you will really enjoy the \"Heavenly Hiway Hymns.\"  Be blessed.", "overall": 5.0, "summary": "Hand Clapping Toe Tapping Oldies", "unixReviewTime": 1325462400, "reviewTime": "01 2, 2012"}
{"reviewerID": "A1KLCGLCXYP1U1", "asin": "0000013714", "reviewerName": "Paul L \"Paul Lytle\"", "helpful": [0, 0], "reviewText": "One review advised this book was large print, however it isn't and I had to return it. I'm sure the contents of the hymnal are very nice, just not what I needed.", "overall": 3.0, "summary": "Misleading", "unixReviewTime": 1376092800, "reviewTime": "08 10, 2013"}
{"reviewerID": "A37W6POFWIVG13", "asin": "0000013714", "reviewerName": "Prisley", "helpful": [3, 3], "reviewText": "Heavenly Highway Hymns contains great hymns.  These songs are filled with the love for Jesus and of the grace He gives to us.  A blessing in every song.", "overall": 5.0, "summary": "Wonderful Hymn Book", "unixReviewTime": 1316131200, "reviewTime": "09 16, 2011"}
{"reviewerID": "A2EIPZNHAEXZHJ", "asin": "0000013714", "reviewerName": "readingfan", "helpful": [2, 2], "reviewText": "The hymn selection in this edition is very fine, but the paper quality leaves something to be desired.  For a book in which singers are going to be thumbing through, using the index, turning pages as directed, the paper quality does not look like it will stand up to long term use.", "overall": 4.0, "summary": "Great hymn selection", "unixReviewTime": 1325030400, "reviewTime": "12 28, 2011"}
